{"chunks": ["EMOTION TRACKING IN UKRAINE-RUSSIA WAR TWEETS: A COMPARISON OF MACHINE LEARNING AND VADER Presented by : Sanjil Kokare (775482) Professor : Dr. Michael Colombo Subject : Analysis of Semi-Structured & Unstructured Data University : Fom University of Applied Sciences", "Content 1.Introduction 2.Data Overview 3.Text Preprocessing 4.Machine Learning Model Understanding Public Emotion 5.VADER Lexicon-Based Emotion Detection 6.Model vs VADER: Sentiment Comparison 7.Conclusion & Future Scope 8.Tools and Libraries 9.References", "INTRODUCTION The Ukraine - Russia war, one of the most geopolitically impactful events of the decade. Many countries support Ukraine by imposing economic sanctions against Russia. It generated millions of tweets reflecting fear, anger, hope, and global solidarity. Russia on 24 February 2022 launched a wave of missile attacks across many of Ukraine’s biggest cities. At least seven civilians were killed and 33 injured between Wednesday and Thursday, Ukraine’s presidential office said, including one person killed and 23 wounded when four Kalibr cruise missiles hit the southern city of Mykolaiv. A i m This presentation aims to analyze that public emotion using natural language processing specifically, by comparing a machine learning model trained on tweet data with VADER, a rule-based sentiment analyzer designed for social media.", "Source: Kaggle – Amir Motefaker's Ukraine–Russia War Tweets Dataset   ~10,000+ tweets collected during the early phase of the conflict   Key columns used: tweet (text) language (filter for English) username (user frequency, optional) Preprocessing: Removed URLs, hashtags, mentions, special characters Converted to lowercase Stored cleaned version in 'cleaned_tweet'    DATASET OVERVIEW", "TEXT PREPROCESSING Removed: URLs, mentions, hashtags, special characters Lowercased and cleaned: e.g., 'WAR!!!' →  'war' Result saved as: 'tweet' Cleaned text enables consistent vectorization and model performance. Cleaning Most Frequent Word", "MACHINE LEARNING MODEL UNDERSTANDING PUBLIC EMOTION Vectorized text using TF-IDF (max 5000 features) Trained Logistic Regression model Labels: Positive →  Encouragement, support Neutral →  News, factual updates Negative →  Fear, violence, outrage", "VADER LEXICON-BASED EMOTION DETECTION VADER (Valence Aware Dictionary for sEntiment Reasoning) Pre-trained on social media text Better at catching emotionally charged or context-rich tweets Labels tweets as Positive, Neutral, or Negative based on rule-based scoring", "MODEL VS VADER: SENTIMENT COMP ARISON Applied both ML model and VADER on the same tweets Created crosstab and heatmap to compare predictions Findings:          VADER detects more negative sentiment in emotional or violent contexts           ML model misclassifies due to lack of semantic understanding", "CONCLUSION & FUTURE SCOPE Sentiment analysis reveals how society reacts to war events ML and VADER each offer value — together they offer deeper insight Future improvements:         Use BERT for better contextual accuracy         Build a real-time emotional monitoring dashboard for crisis response", "TOOLS OR LIBRARIES Data Handling & Preprocessing pandas – for reading, filtering, and managing tweet data re – for regex-based text cleaning numpy – for numerical operations (if used implicitly) Natural Language Processing (NLP) TextBlob – to calculate sentiment polarity (ML baseline) vaderSentiment – rule-based sentiment analysis for social media nltk – if used for tokenization or stopword filtering (optional) Machine Learning & Modeling scikit-learn (sklearn): TfidfVectorizer – to convert tweet text into numeric features LogisticRegression – sentiment classification model train_test_split – to split the dataset accuracy_score, classification_report – evaluation metricsVisualization matplotlib – for bar and pie charts seaborn – for heatmaps and enhanced visual styling wordcloud – for visualizing high-frequency emotional termsDevelopment Environment Google Colab – for coding, visualizations, and live demo Canva Editor – to generate your slides", "REFERENCES  Dataset Source Ukraine–Russia Twitter Sentiment Dataset  https://www.kaggle.com/code/amirmotefaker/ukraine-russia-war-twitter-sentiment-analysis VADER Sentiment Lexicon Official GitHub (by C.J. Hutto and Eric Gilbert, Georgia Tech):  https://github.com/cjhutto/vaderSentiment Research Paper PDF:  https://ojs.aaai.org/index.php/ICWSM/article/view/14550 TF-IDF & Logistic Regression Concepts Scikit-learn TF-IDF Vectorizer:  https://scikit-learn.org/stable/modules/generated/sklearn.feature_extraction.text.TfidfVectorizer.html Logistic Regression in NLP:  https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression Background & News Sources Reuters Ukraine Crisis Coverage:  https://www.reuters.com/places/ukraine/ Twitter Blog: Role in Crisis Communication:  https://blog.twitter.com/en_us/topics/company/2022/supporting-the-people-of-ukraine"]}